doc.org
# -*- mode: org; fill-column: 60; -*-
#+STARTUP: showall indent hidestars

* Intro

У нас есть 4 трека, каждый из них может одновременно вести
несколько голосований.

Я пока не придумал ничего лучше, чем положить все
настраиваемые параметры в структуру голосования.

По сути треки отличаются только базовыми настройками этих
голосований.

Для всех голосований Предложение считается принятым, если до
его окончания не было получено достаточно возражений.

Tracks variants:
- validators requests
- grant distibution
- payments of rewards
- regular insurance payments

* Init

При инициализации запоминаем, кто ~owner~:

#+BEGIN_SRC vyper :noweb-ref data
  owner: public(address)
#+END_SRC

#+BEGIN_SRC vyper :noweb-ref init
  self.owner = msg.sender
#+END_SRC

[TODO:gmm] - Init нужен чтобы определить, кто может
добавлять тех, кому разрешено начинать голосование. По идее,
только контракт всеобщего голосования DAO может сделать это.

* Ownership

Мы можем проверять ~onlyOwner~:

#+NAME: only_owner
#+BEGIN_SRC vyper
  assert msg.sender = self.owner
#+END_SRC

Надо уметь трансферить ~owner~-а:

#+NAME: transfer_ownership
#+BEGIN_SRC vyper :noweb yes
  @external
  def transferOwnership(_newOwner: address):
      <<only_owner>>
      self.owner = _newOwner
#+END_SRC

* Ballot Makers

Только "узкий круг ограниченных людей" может начинать
голосования. Храним их в мапе:

#+BEGIN_SRC vyper :noweb-ref data
  ballotMakers: public(HashMap[address, bool])
#+END_SRC

Проверка, что начинающий голосование, относится к этому
кругу людей:

#+NAME: only_ballot_maker
#+BEGIN_SRC vyper
  assert ballotMakers[msg.sender] = True
#+END_SRC

~Owner~ может добавлять и удалять ~ballot makers~:

#+NAME: add_ballot_maker
#+BEGIN_SRC vyper :noweb yes
  @external
  def addBallotMaker(_param: address):
      <<only_owner>>
      ballotMakers[_param] = True
#+END_SRC

#+NAME: del_ballot_maker
#+BEGIN_SRC vyper :noweb yes
  @external
  def delBallotMaker(_param: address):
      <<only_owner>>
      ballotMakers[_param] = False
#+END_SRC

* Ballot Time

Для разных треков разное время, но пока так:

#+BEGIN_SRC vyper :noweb-ref data
ballotTime: public(timedelta)
#+END_SRC

* Ballot Stake

Ballot maker мог бы спамить голосованиями, а учитывая что
они по умолчанию проходят, этого нельзя допускать.

Мы хотим, чтобы возможность создавать easy-track голосования
была как-то привязана к LDO-токенам. При этом, LDO-токены,
которые иницировали голосование, не должны иметь возможность
инициировать второе голосование, пока первое не закончилось.

Возможна атака, при которой возражающий может продать
проголосовавшие жетоны и сразу же купить новые, чтобы
проголосовать снова. Чтобы этого не произошло, в контракте
easy-track необходимо обратиться к менеджеру токенов, чтобы
запретить передачу этих токенов до конца голосования. Но это
вызывает проблемы с аудитом и обновлением LDO-контракта,
чего хочется избежать.

Можно использовать остатки на момент блока, в котором
началось голосование. То есть голосовать могут только
жетоны, которые не были перемещены с момента начала
голосования. Мне показалось это сложным в реализации.

Поэтому мы требуем замораживать токены в голосовании - когда
ballot maker начинает голосование, ему нужно приложить
токены, чтобы нельзя было создавать слишком много
голосований. Порог, ниже которого голосование не начнется:

#+BEGIN_SRC vyper :noweb-ref data
  minBallotStake: public(decimal)
#+END_SRC

Проверка, что стейка достаточно для начала голосования. Тут
мы считаем, что порог общий для всех голосований во всех
треках.

#+NAME: only_sufficient_stake
#+BEGIN_SRC vyper
  assert msg.value >= self.minBallotStake
#+END_SRC

[NOTE:gmm] - Возможна атака, когда ~ballot maker~ создает
много голосований, в рассчете на то, у возражающих не хватит
стейка чтобы возразить по всем голосованиям и какая-то часть
голосований пройдет без возражений. Например, так можно
вывести деньги на грантовые программы. Даже если гранты
переводятся на мультисиг, это требует только договоренности
с владельцами мультисига, которые тоже могут иметь
заинтересованность в выводе денег.

* Ballot

Голосования лежат в мапе, где ключ - хэш голосования, а
значение - структура голосования:

#+BEGIN_SRC vyper :noweb-ref data
  ballots: public(HashMap[string[255], Ballot])
#+END_SRC

#+BEGIN_SRC vyper :noweb-ref structs
  struct Ballot:
    name: string[255]
    ballotMaker: address
    ballotMakerStake: wei_value
    deadline: timestamp
    objections: HashMap(address, wei_value)
    objections_total: wei_value
#+END_SRC

* Make Ballot

Функция для начала голосования, после проверок создает
новый Ballot:

Проверка, нет ли уже такого голосования. Она нужна,
т.к. если не проверить, то новое голосование затрет
предыдущее.

#+NAME: is_ballot_not_exists
#+BEGIN_SRC vyper
  assert self.ballots[_name] = False
#+END_SRC

[VRFY:gmm] - Возможно нужно минимальное время между
попытками одного пользователя создать новое голосование?

Когда Ballot maker отдает нам свой стейк мы должны
запомнить, сколько он застейкал, чтобы потом разрешить ему
вернуть эту сумму.

#+NAME: save_ballot_stake
#+BEGIN_SRC vyper
  self.ballots[_name].ballotMakerStake = msg.value
#+END_SRC

После окончания голосования, нужно разрешать вернуть стейк
ballotMaker-у, но только всю сумму разом и только один раз.

#+NAME: withdraw_ballot_stake
#+BEGIN_SRC vyper
  @external
  def withdrawBallotStake(_name: string[255]):
      assert self.ballots[_name].active = False
      assert self.ballots[_name].ballotMakerStake > 0
      _ballotMaker = self.ballots[_name].ballotMaker
      _amount: wei_value = self.ballots[_name].ballotMakerStake
      self.ballots[_name].ballotMakerStake = 0
      send(_ballotMaker, _amount)
#+END_SRC

Функция создания голосования:

#+NAME: make_ballot
#+BEGIN_SRC vyper :noweb yes
  @public
  @payable
  def make_ballot(_name: string[255]):
      <<only_ballot_maker>>
      <<only_sufficient_stake>>
      <<is_ballot_not_exists>>
      self.ballots[_name] = Ballot({
          name = _name,
          active = True,
          ballotMaker = msg.sender
          deadline = block.timestamp + self.ballotTime,
          result = True
      })
      <<save_ballot_stake>>
#+END_SRC

* Send objection

Проверка не истекло ли время голосования.

#+NAME: only_active
#+BEGIN_SRC vyper
  assert block.timestamp < self.ballots[_name].deadline
#+END_SRC

Порог возражений:

#+BEGIN_SRC vyper :noweb-ref data
  objections_threshold: public(wei_value)
#+END_SRC

Проверка, достаточно ли уже возражений

#+NAME: objections_not_enough
#+BEGIN_SRC vyper
  assert self.ballots[_name].objections_total < self.objections_threshold
#+END_SRC

Функция возражения, работает только до дедлайна и пока
возражений недостаточно:

#+NAME: send_objection
#+BEGIN_SRC vyper :noweb yes
  @public
  @payable
  def sendObjection(_name: string[266]):
      <<only_active>>
      <<objections_not_enough>>
      self.ballots[_name].objections[msg.sender] = msg.value
      _total = self.ballots[_name].objections_total
      self.ballots[_name].objections_total = total + msg.value
#+END_SRC

* Ballot Endings

Считаем, что у нас есть функция, которую можно вызвать, и
она сработает, если время голосования прошло, а возражений
поступило недостаточно.

[TODO:gmm] - Как задавать эту функцию коссвенно? В новом
оракуле есть кусок, который позволяет зашивать проивольный
смарт-контракт и дергать его - посмотреть как это
сделано. Надо вызвать функцию, которая переведет
деньги. Читать как сделано в арагоне. В lido dao есть адреса
арагоновских проксиков, в арагоне написано как это работает
(etherscan) CallData определяет что именно дергать. Также
посмотреть как у арагона это сделано? Посмотреть что
происходит при enacting голосования арагона в lido DAO, код
арагона на etherscan

#+NAME: ballot_result
#+BEGIN_SRC vyper :noweb yes
  @external
  def ballotResult()
      assert block.timestamp > self.ballots[_name].deadline
      <<objections_not_enough>>
      some_action_stub()
#+END_SRC

[TODO:gmm] - Если голосование завершено, то здесь нужен
event

